//=============================================================================
//
//カウントダウン処理 [countdown.h]
// Author : KADO TAKUMA
//
//=============================================================================
#ifndef _COUNTDOWN_H_
#define _COUNTDOWN_H_

//=============================================================================
// インクルードファイル
//=============================================================================
#include "main.h"
#include "object2D.h"

//=============================================================================
// マクロ定義
//=============================================================================
#define COUNTDOWN_TEXTURE	(4)				// 使用するテクスチャの枚数
#define COUNTDOWN_WIDTH		(500.0f)		// カウントダウンの幅
#define COUNTDOWN_HEIGHT	(500.0f)		// カウントダウンの高さ

//=============================================================================
// 列挙型
//=============================================================================
enum ECountDown
{
	COUNTDOWN_3,
	COUNTDOWN_2,
	COUNTDOWN_1,
	COUNTDOWN_START,
	COUNTDOWN_MAX
};

//=============================================================================
// クラスの定義
//=============================================================================
class CCountDown : public CObject_2D
{
public:
	//--------------------------------
	// コンストラクタとデストラクタ
	//--------------------------------
	CCountDown();
	~CCountDown() override;

	//--------------------------------
	// メンバー関数
	//--------------------------------
	HRESULT Init(void) override;									// 初期化処理
	void Uninit(void) override;										// 終了処理
	void Update(void) override;										// 更新処理
	void Draw(void) override;										// 描画処理
	static CCountDown *Create(D3DXVECTOR3 pos);						// アイテムの生成関数

private:
	//--------------------------------
	// メンバー変数
	//--------------------------------
	static LPDIRECT3DTEXTURE9 m_pTexture[COUNTDOWN_TEXTURE];		// テクスチャのポインタ
	int m_nCounter;
};

#endif