//=============================================================================
//
// firstStage.h
// Author : Ricci Alex
//
//=============================================================================
#ifndef _FIRST_STAGE_H
#define _FIRST_STAGE_H

//=============================================================================
//インクルードファイル
//=============================================================================
#include "game.h"

//=============================================================================
//前方宣言
//=============================================================================

class CFirstStage : public CGame
{
public:
	CFirstStage();								//コンストラクタ
	~CFirstStage() override;					//デストラクタ
												
	HRESULT Init(void);							//初期化処理
	void Uninit(void);							//終了処理
	void Update(void);							//更新処理
												
	static CFirstStage* Create(void);			//生成処理

private:

};


#endif