//=============================================================================
//
// mode.cpp
// Author : Ricci Alex
//
//=============================================================================

//=============================================================================
//インクルードファイル
//=============================================================================
#include "mode.h"

//コンストラクタ
CMode::CMode()
{
	m_bGame = false;
}

//コンストラクタ
CMode::CMode(const bool bGame) : m_bGame(bGame)
{

}

//デストラクタ
CMode::~CMode()
{

}

//ゲームであるかどうか
const bool CMode::IsGame(void)
{
	return m_bGame;
}