//=============================================================================
//
// 番号処理 [number.h]
// Author : KADO TAKUMA
//
//=============================================================================
#ifndef _NUMBER_H_
#define _NUMBER_H_

//=============================================================================
// インクルードファイル
//=============================================================================
#include "main.h"
#include "object2D.h"

//=============================================================================
// クラスの定義
//=============================================================================
class CNumber : public CObject_2D
{
public:
	//-------------------------------------------------------------------------
	// コンストラクタとデストラクタ
	//-------------------------------------------------------------------------
	CNumber();
	~CNumber() override;

	//-------------------------------------------------------------------------
	// メンバー関数
	//-------------------------------------------------------------------------
	HRESULT Init(void) override;								// 初期化処理
	void Uninit(void) override;									// 終了処理
	void Update(void) override;									// 更新処理
	void Draw(void) override;									// 描画処理
	static CNumber *Create(D3DXVECTOR3 pos, D3DXVECTOR2 size);	// 生成処理
	static HRESULT Load(void);									// テクスチャの読み込み
	static void UnLoad(void);									// テクスチャの破棄
	void SetShow(bool bShow) { m_bShow = bShow; };

private:
	//-------------------------------------------------------------------------
	// メンバー変数
	//-------------------------------------------------------------------------
	static LPDIRECT3DTEXTURE9 m_pTexture;		// テクスチャのポインタ
	int  m_nPattrenAnim;
	bool m_bShow;
};

#endif
