//=============================================================================
//
// title.h
// Author : Ricci Alex
//
//=============================================================================
#ifndef _TITLE_H
#define _TITLE_H

//=============================================================================
//インクルードファイル
//=============================================================================
#include "mode.h"

//=============================================================================
//前方宣言
//=============================================================================


class CTitle : public CMode
{
public:
	CTitle();
	~CTitle() override;

	HRESULT Init(void) override;				//初期化処理
	void Uninit(void) override;					//終了処理
	void Update(void) override;					//更新処理

	static CTitle* Create(void);				//生成処理

private:

};



#endif