//=============================================================================
//
// tutorial.h
// Author : Ricci Alex
//
//=============================================================================
#ifndef _TUTORIAL_H
#define _TUTORIAL_H

//=============================================================================
//インクルードファイル
//=============================================================================
#include "mode.h"

//=============================================================================
//前方宣言
//=============================================================================


class CTutorial : public CMode
{
public:
	CTutorial();
	~CTutorial() override;

	HRESULT Init(void) override;				//初期化処理
	void Uninit(void) override;					//終了処理
	void Update(void) override;					//更新処理

	static CTutorial* Create(void);				//生成処理

private:

};



#endif